dveltri/PIC18F25K20-NRF/main.c
unsigned int16 GetInputs(void)
{
   unsigned short sts=0;
   sts|=input_state(GPIO00)<<0;
   sts|=input_state(GPIO01)<<1;
   sts|=input_state(GPIO02)<<2;
   sts|=input_state(GPIO03)<<3;
   sts|=input_state(GPIO04)<<4;
   sts|=input_state(GPIO05)<<5;
   sts|=input_state(GPIO06)<<6;
   sts|=input_state(GPIO07)<<7;
   sts|=input_state(GPIO08)<<8;
   sts|=input_state(GPIO09)<<9;
   sts|=input_state(GPIO10)<<10;
   sts|=input_state(GPIO11)<<11;
   sts|=input_state(GPIO12)<<12;
   sts|=input_state(GPIO13)<<13;
   sts|=input_state(GPIO14)<<14;
   sts|=input_state(GPIO15)<<15;
   return sts;
}

void SetOutput(unsigned char Out,unsigned char value)
{
   if(Out==0)output_bit(GPIO00,value);
   if(Out==1)output_bit(GPIO01,value);
   if(Out==2)output_bit(GPIO02,value);
   if(Out==3)output_bit(GPIO03,value);
   if(Out==4)output_bit(GPIO04,value);
   if(Out==5)output_bit(GPIO05,value);
   if(Out==6)output_bit(GPIO06,value);
   if(Out==7)output_bit(GPIO07,value);
   if(Out==8)output_bit(GPIO08,value);
   if(Out==9)output_bit(GPIO09,value);
   if(Out==10)output_bit(GPIO10,value);
   if(Out==11)output_bit(GPIO11,value);
   if(Out==12)output_bit(GPIO12,value);
   if(Out==13)output_bit(GPIO13,value);
   if(Out==14)output_bit(GPIO14,value);
   if(Out==15)output_bit(GPIO15,value);
}

#if(DgvTask!=0)
int8 InstTask(unsigned char Task)
{
   char Idx=0;
   if(Task<LsEventos || Task>Task1)
      return -1;
   for(Idx=0;Idx<Events_Count;Idx++)
   {
      if(iGP.Events[Idx]==Task)
         return Idx;
   }
   for(Idx=0;Idx<Events_Count;Idx++)
   {
      if(iGP.Events[Idx]==0)
      {
         iGP.Events[Idx]=Task;
         return Idx;
      }
   }
   Error(Er_NoEvtFree);
   return -1;
}
#endif
//=============================================================================
#include "DgvP.c"
//=============================================================================
#include "DgvHeap.c"
//=============================================================================  
#include "EeData.c"
//=============================================================================
#include "Libdgv.c"
//=============================================================================
#include "radioPinFunctions.c"
#include "nrf24.c"

